Repository: AigizK/bashkort-parallel-corpora
Catalog: tmx/Курултай6.tmx
Source language: ba
Languages: ru

source: 1940 йылдың 23 майында Башҡортостандың Өфө районы Булгаков ауылында тыуа.
ru: Родился 23 мая 1940 г. в селе Булгаково Уфимского района Башкирской АССР.

source: Юғары белемле – Силәбе политехник институтын тамамлай.
ru: Образование высшее – окончил Челябинский политехнический институт.

source: 1957-1960 йылдарҙа Совет Армияһы сафтарында хеҙмәт итә. Хеҙмәт юлын Силәбе политехник институтын тамамлағандан һуң 1965 йылда ПТО инженеры сифатында башлай.
ru: В 1957-1960 гг. служил в рядах Советской Армии. Трудовую деятельность начал в 1965 г. после окончания Челябинского политехнического института инженером ПТО.

source: Башҡортостан автомобилдәр идараһының 2-се һанлы Өфө йөк автомобилдәре хужалығы баш инженеры булып эшләй.
ru: Работал главным инженером Уфимского грузового автохозяйства № 2 Башавтоуправления.

source: 1968 йылдан алып төҙөлөш тресында транспорт эшен ойоштороу бүлеге башлығы вазифаһын атҡара.
ru: С 1968 по 1969 года – начальник отдела организации работ транспорта в строительстве треста «Оргтехстрой».

source: 1969-1970 йылдарҙа - «Башкирстройтранс» тресының 1-се һанлы автомобилдәр базаһында баш инженер.
ru: В !969-1970 гг. работал главным инженером автобазы № 1 треста «Башкирстройтранс».

source: 1970-1975 йылдарҙа - КПСС-тың Өфө ҡала комитеты сәнәғәт-транспорт бүлегендә инструктор, 1975-1887 йылдарҙа КПСС-тың Өфө ҡалаһы Киров район комитетының икенсе секретары вазифаһын башҡара.
ru: В 1970-1975 гг. работал инструктором промышленно-транспортного отдела Уфимского горкома КПСС, в 1975-1887 гг. – вторым секретарем Кировского горкома КПСС.

source: 1987 йылда Киров районы Советы Башҡарма комитеты рәйесе урынбаҫары булып эшкә күсерелә, аҙаҡ уның рәйесе булып 1990 йылға тиклем эшләй.
ru: В 1987 г. переведен на работу заместителем председателя, председателем Исполкома Кировского районного Совета, где проработал до 1990 г.

source: 1990-1994 йылдарҙа – Башҡортостан Республикаһы Юғары Советы Рәйесенең беренсе урныбаҫары.
ru: В 1990-1994 гг. – первый заместитель Председателя Верховного Совета Республики Башкортостан.

source: 1994 йылдан 1995 йылға тиклем – Башҡортостан Республикаһы Юғары Советы Рәйесе вазифаһын башҡарыусы, Юғары Совет Рәйесе, Юғары Совет Президиумы рәйесе.
ru: С. 1994 по 1995 г. – исполняющий обязанности, Председатель Верховного Совета, председатель Президиума Верховного Совета Республики Башкортостан.

source: «Почет билдәһе» ордены, миҙал менән бүләкләнә.
ru: Награжден орденом «Знак Почета», медалью.
